microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dab-pwm-configuration.X/sources/driver_chiplayer/mcc_extenstion/drv_mcc_extension.h
//    RPx_INPUT_RP65 					= 65, ///> Port Pin RD1
//    RPx_INPUT_RP66 					= 66, ///> Port Pin RD2
//    RPx_INPUT_RP67 					= 67, ///> Port Pin RD3
//    RPx_INPUT_RP68 					= 68, ///> Port Pin RD4
//    RPx_INPUT_RP69 					= 69, ///> Port Pin RD5
//    RPx_INPUT_RP70 					= 70, ///> Port Pin RD6
//    RPx_INPUT_RP71 					= 71, ///> Port Pin RD7
//    RPx_INPUT_RP72 					= 72, ///> Port Pin RD8
//    RPx_INPUT_RP73 					= 73, ///> Port Pin RD9
//    RPx_INPUT_RP74 					= 74, ///> Port Pin RD10
//    RPx_INPUT_RP75 					= 75, ///> Port Pin RD11
//    RPx_INPUT_RP76 					= 76, ///> Port Pin RD12
//    RPx_INPUT_RP77 					= 77, ///> Port Pin RD13
//    RPx_INPUT_RP78 					= 78, ///> Port Pin RD14
//    RPx_INPUT_RP79 					= 79, ///> Port Pin RD15
//    RPx_INPUT_DAC3_pwm_req_on 		= 164, ///> Internal
//    RPx_INPUT_DAC3_pwm_req_off 		= 165, ///> Internal
//    RPx_INPUT_DAC2_pwm_req_on 		= 166, ///> Internal
//    RPx_INPUT_DAC2_pwm_req_off 		= 167, ///> Internal
//    RPx_INPUT_DAC1_pwm_req_on 		= 168, ///> Internal
//    RPx_INPUT_DAC1_pwm_req_off 		= 169, ///> Internal
//    RPx_INPUT_RP176 				= 176, ///> Virtual RPV0
//    RPx_INPUT_RP177 				= 177, ///> Virtual RPV1
//    RPx_INPUT_RP178 				= 178, ///> Virtual RPV2
//    RPx_INPUT_RP179 				= 179, ///> Virtual RPV3
//    RPx_INPUT_RP180 				= 180, ///> Virtual RPV4
//    RPx_INPUT_RP181 				= 181  ///> Virtual RPV5
//};
//typedef enum RPx_INPUT_e RPx_INPUT_t;
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_INPUT_e 
// * @brief  list of PWM PCI inputs
// * @details
// *  
// **********************************************************************************/
//enum PWM_PCI_INPUT_e
//{
//    PWM_PCI_INPUT8 = 0,
//    PWM_PCI_INPUT9 = 1,
//    PWM_PCI_INPUT10 = 2,
//    PWM_PCI_INPUT11 = 3
//};
//typedef enum PWM_PCI_INPUT_e PWM_PCI_INPUT_t;
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_MaptoPin(PWM_PCI_INPUT_t pciIndex, RPx_INPUT_t pin)
// * @brief  Map PWM PCI input to a pin
// * @details
// * details taken from dsPIC33CK256MP508 datasheet
// **********************************************************************************/
//inline static void PWM_PCI_INPUT_MaptoPin(PWM_PCI_INPUT_t pciIndex, RPx_INPUT_t pin)
//{
//    __builtin_write_RPCON(0x0000); // unlock PPS
//    switch (pciIndex)
//    {
//        case PWM_PCI_INPUT8:
//            RPINR12bits.PCI8R = pin;
//            break;
//            
//        case PWM_PCI_INPUT9:
//            RPINR12bits.PCI9R = pin;
//            break;
//
//        case PWM_PCI_INPUT10:
//            RPINR13bits.PCI10R = pin;
//            break;
//
//        case PWM_PCI_INPUT11:
//            RPINR13bits.PCI11R = pin;
//            break;            
//            
//        default:
//            break;            
//    };
//    __builtin_write_RPCON(0x0800); // lock PPS
//}
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_INPUT_e 
// * @brief  list of PWM PCI inputs
// * @details
// *  
// **********************************************************************************/
//enum PWM_PCI_SOURCE_SELECT_e
//{
//    PWM_PCI_SOURCE_SELECT_CLC1 		   = 31,
//    // 30 is reserved           
//    PWM_PCI_SOURCE_SELECT_CMP3         = 29,
//    PWM_PCI_SOURCE_SELECT_CMP2         = 28,
//    PWM_PCI_SOURCE_SELECT_CMP1         = 27,
//    PWM_PCI_SOURCE_SELECT_PWM_EVENT_D  = 26,
//    PWM_PCI_SOURCE_SELECT_PWM_EVENT_C  = 25,
//    PWM_PCI_SOURCE_SELECT_PWM_EVENT_B  = 24,
//    PWM_PCI_SOURCE_SELECT_PWM_EVENT_A  = 23,
//    PWM_PCI_SOURCE_SELECT_PCI22		   = 22,	///> device pin
//    PWM_PCI_SOURCE_SELECT_PCI21		   = 21,	///> device pin
//    PWM_PCI_SOURCE_SELECT_PCI20		   = 20,	///> device pin
//    PWM_PCI_SOURCE_SELECT_PCI19		   = 19,	///> device pin
//    PWM_PCI_SOURCE_SELECT_PCI18R	   = 18,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI17R	   = 17,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI16R	   = 16,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI15R 	   = 15,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI14R 	   = 14,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI13R       = 13,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI12R       = 12,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI11R       = 11,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI10R	   = 10,	///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI9R        = 9,	    ///> RPn input
//    PWM_PCI_SOURCE_SELECT_PCI8R        = 8,
//    // 7 is reserved,           
//    // 6 is reserved,           
//    // 5 is reserved,           
//    // 4 is reserved,           
//    PWM_PCI_SOURCE_SELECT_COMBO_TRIG_B = 3,
//    PWM_PCI_SOURCE_SELECT_COMBO_TRIG_A = 2,
//    PWM_PCI_SOURCE_SELECT_PWMPCI_MUX   = 1,
//    PWM_PCI_SOURCE_SELECT_TIED_TO_0    = 0
//};
//
//typedef enum PWM_PCI_SOURCE_SELECT_e PWM_PCI_SOURCE_SELECT_t;
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_Sync_Source_Select(uint16_t pwmIndex, PWM_PCI_SOURCE_SELECT_t source)
// * @brief  set PCI source (PSS field) for PCI sync
// * @details
// **********************************************************************************/
//inline static void PWM_PCI_Sync_Source_Select(uint16_t pwmIndex, PWM_PCI_SOURCE_SELECT_t pciSource)
//{
//    switch (pwmIndex)
//    {
//        case 1:
//            PG1SPCILbits.PSS = pciSource;
//            break;
//        case 2:
//            PG2SPCILbits.PSS = pciSource;
//            break;
//        case 3:
//            PG3SPCILbits.PSS = pciSource;
//            break;
//        case 4:
//            PG4SPCILbits.PSS = pciSource;
//            break;
//        case 5:
//            PG5SPCILbits.PSS = pciSource;
//            break;
//        case 6:
//            PG6SPCILbits.PSS = pciSource;
//            break;
//        case 7:
//            PG7SPCILbits.PSS = pciSource;
//            break;      
//        case 8:
//            PG8SPCILbits.PSS = pciSource;
//            break;      
//        default:
//            break;
//    };
//}
//
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_ACCEPTANCE_QUALIFER_e 
// * @brief  list of sources of PWM acceptance qualifers
// * @details
// *  
// **********************************************************************************/
//enum PWM_PCI_ACCEPTANCE_QUALIFER_e
//{
//    PWM_PCI_ACCEPTANCE_QUALIFER_NONE = 0, ///> No acceptance qualifier is used (qualifier forced to ?1?)
//    PWM_PCI_ACCEPTANCE_QUALIFER_DUTY = 1, ///> Duty cycle is active (base PWM Generator signal)
//    PWM_PCI_ACCEPTANCE_QUALIFER_LEB = 2, ///> LEB is active
//    PWM_PCI_ACCEPTANCE_QUALIFER_PWM = 3, ///> PWM Generator is triggered
//    PWM_PCI_ACCEPTANCE_QUALIFER_PCI_PWMPCI = 4, ///> Selects PCI Source #1 (PWM Generator output selected by the PWMPCI[2:0] bits)
//    PWM_PCI_ACCEPTANCE_QUALIFER_PCI_SOURCE8 = 5, ///> Selects PCI Source #8
//    PWM_PCI_ACCEPTANCE_QUALIFER_PCI_SOURCE9 = 6, ///> Selects PCI Source #9
//    PWM_PCI_ACCEPTANCE_QUALIFER_SWPCI = 7 ///> SWPCI control bit only (qualifier forced to ?0?)
//};
//typedef enum PWM_PCI_ACCEPTANCE_QUALIFER_e PWM_PCI_ACCEPTANCE_QUALIFER_t;
//
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_Fault_AcceptanceQualifierSource(uint16_t pwmIndex, PWM_PCI_ACCEPTANCE_QUALIFER_e source)
// * @brief  set source of fault PCI acceptance qualifier
// * @details
// **********************************************************************************/
//inline static void PWM_PCI_Fault_AcceptanceQualifierSource(uint16_t pwmIndex, PWM_PCI_ACCEPTANCE_QUALIFER_t source)
//{
//    switch (pwmIndex)
//    {
//        case 1:
//            PG1FPCILbits.AQSS = source;
//            break;
//        case 2:
//            PG2FPCILbits.AQSS = source;
//            break;
//        case 3:
//            PG3FPCILbits.AQSS = source;
//            break;
//        case 4:
//            PG4FPCILbits.AQSS = source;
//            break;
//        case 5:
//            PG5FPCILbits.AQSS = source;
//            break;
//        case 6:
//            PG6FPCILbits.AQSS = source;
//            break;
//        case 7:
//            PG7FPCILbits.AQSS = source;
//            break;
//        case 8:
//            PG8FPCILbits.AQSS = source;
//            break;      
//        default:
//            break;
//    };
//}
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_TRIG_MODE_e 
// * @brief  set PWM trigger mode
// * @details
// * TRGNOD field
// **********************************************************************************/
//enum PWM_TRIG_MODE_e
//{
//    PWM_TRIG_MODE_SINGLE = 0,
//    PWM_TRIG_MODE_RETRIGGERABLE = 1
//};
//typedef enum PWM_TRIG_MODE_e PWM_TRIG_MODE_t;
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_Fault_AcceptanceQualifierSource(uint16_t pwmIndex, PWM_PCI_ACCEPTANCE_QUALIFER_e source)
// * @brief  set source of fault PCI acceptance qualifier
// * @details
// **********************************************************************************/
//inline static void PWM_Trigger_Mode(uint16_t pwmIndex, PWM_TRIG_MODE_t trigMode)
//{
//    switch (pwmIndex)
//    {
//        case 1:
//            PG1CONHbits.TRGMOD = trigMode;
//            break;
//        case 2:
//            PG2CONHbits.TRGMOD = trigMode;
//            break;
//        case 3:
//            PG3CONHbits.TRGMOD = trigMode;
//            break;
//        case 4:
//            PG4CONHbits.TRGMOD = trigMode;
//            break;
//        case 5:
//            PG5CONHbits.TRGMOD = trigMode;
//            break;
//        case 6:
//            PG6CONHbits.TRGMOD = trigMode;
//            break;
//        case 7:
//            PG7CONHbits.TRGMOD = trigMode;
//            break;
//        case 8:
//            PG8CONHbits.TRGMOD = trigMode;
//            break;      
//        default:
//            break;
//    };
//}
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_TERM_e 
// * @brief  termination event selection 
// * @details
// **********************************************************************************/
//enum PWM_PCI_TERM_e
//{
//    PWM_PCI_TERM_MANUAL		= 0,	//> Manual Terminate: Terminate on a write of ?1? to the SWTERM bit location
//    PWM_PCI_TERM_AUTO 		= 1,    //> Auto-Terminate: Terminate when PCI source transitions from active to inactive
//    PWM_PCI_TERM_PGxTRIGA	= 2,    //> PGxTRIGA trigger event
//    PWM_PCI_TERM_PGxTRIGB   = 3,    //> PGxTRIGB trigger event
//    PWM_PCI_TERM_PGxTRIGC   = 4,    //> PGxTRIGC trigger event
//    PWM_PCI_TERM_PCI_SOURCE1 = 5,   //> Selects PCI Source #1 (PWM Generator output selected by the PWMPCI[2:0] bits)
//    PWM_PCI_TERM_PCI_SOURCE8 = 6,   //> Selects PCI Source #8
//    PWM_PCI_TERM_PCI_SOURCE9 = 7    //> Selects PCI Source #9
//};
//typedef enum PWM_PCI_TERM_e PWM_PCI_TERM_t;
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_PCI_Sync_TerminationEventSelect(uint16_t pwmIndex, PWM_PCI_TERM_t trigMode)
// * @brief  select termination event for SYNC PCI
// * @details
// **********************************************************************************/
//inline static void PWM_PCI_Sync_TerminationEventSelect(uint16_t pwmIndex, PWM_PCI_TERM_t termEvent)
//{
//    switch (pwmIndex)
//    {
//        case 1:
//            PG1SPCILbits.TERM = termEvent;
//            break;
//        case 2:
//            PG2SPCILbits.TERM = termEvent;
//            break;
//        case 3:
//            PG3SPCILbits.TERM = termEvent;
//            break;
//        case 4:
//            PG4SPCILbits.TERM = termEvent;
//            break;
//        case 5:
//            PG5SPCILbits.TERM = termEvent;
//            break;
//        case 6:
//            PG6SPCILbits.TERM = termEvent;
//            break;
//        case 7:
//            PG7SPCILbits.TERM = termEvent;
//            break;
//        case 8:
//            PG8SPCILbits.TERM = termEvent;
//            break;       
//        default:
//            break;
//    };
//}
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_Swap_PWMxL_and_PWMxH(uint16_t pwmIndex, bool swap)
// * @brief  set swapPWMH_PWML to true to swap PWML and PWMH
// * @details
// **********************************************************************************/
//inline static void PWM_Swap_PWMxL_and_PWMxH(uint16_t pwmIndex, bool swapPWMH_PWML)
//{
//    switch (pwmIndex)
//    {
//        case 1:
//            PG1IOCONLbits.SWAP = swapPWMH_PWML;
//            break;
//        case 2:
//            PG2IOCONLbits.SWAP = swapPWMH_PWML;
//            break;
//        case 3:
//            PG3IOCONLbits.SWAP = swapPWMH_PWML;
//            break;
//        case 4:
//            PG4IOCONLbits.SWAP = swapPWMH_PWML;
//            break;
//        case 5:
//            PG5IOCONLbits.SWAP = swapPWMH_PWML;
//            break;
//        case 6:
//            PG6IOCONLbits.SWAP = swapPWMH_PWML;
//            break;
//        case 7:
//            PG7IOCONLbits.SWAP = swapPWMH_PWML;
//            break;
//        case 8:
//            PG8IOCONLbits.SWAP = swapPWMH_PWML;
//            break;     
//        default:
//            break;
//    };
//}
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_EVENT_SOURCE_e 
// * @brief  select event source for PWMEVTx register
// * @details
// **********************************************************************************/
//enum PWM_EVENT_SOURCE_e
//{
//    PWM_EVENT_SOURCE_PGTRGSEL = 0,
//    PWM_EVENT_SOURCE_PWM_GEN_OUTPUT = 1,
//    PWM_EVENT_SOURCE_PCI_SYNC_ACTIVE = 2,
//    PWM_EVENT_SOURCE_PCI_FF_ACTIVE = 3,
//    PWM_EVENT_SOURCE_PCI_FF_CL_ACTIVE = 4,
//    PWM_EVENT_SOURCE_PCI_FAULT_ACTIVE = 5,
//    PWM_EVENT_SOURCE_CAHALF = 6,
//    PWM_EVENT_SOURCE_STEER = 7,
//    PWM_EVENT_SOURCE_ADC_TRIG1 = 8,
//    PWM_EVENT_SOURCE_ADC_TRIG2 = 9,
//    PWM_EVENT_SOURCE_HR_ERROR_EVENT = 15
//};
//typedef enum PWM_EVENT_SOURCE_e PWM_EVENT_SOURCE_t;
//
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_EVENTA_Configure
// * @brief  Configure Event A register
// * @details
// **********************************************************************************/
//inline static void PWM_EVENTA_Configure(  uint16_t pwmSource, 
//                                          PWM_EVENT_SOURCE_t eventSource,
//                                          bool invert,
//                                          bool outputEnable,
//                                          bool stretchDisable,
//                                          bool outputSync)
//{
//    if ((pwmSource > 0) && (pwmSource < 9))
//    {        
//        PWMEVTAbits.EVTAPGS = (pwmSource-1);
//        PWMEVTAbits.EVTAOEN = outputEnable;
//        PWMEVTAbits.EVTAPOL = invert;
//        PWMEVTAbits.EVTASTRD = stretchDisable;
//        PWMEVTAbits.EVTASYNC = outputSync;
//        PWMEVTAbits.EVTASEL = eventSource;        
//    };
//}
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_UPD_TRIG_e 
// * @brief  settings for UPDTRG field
// * @details
// *  
// **********************************************************************************/
//enum PWM_UPDTRG_e
//{
//    PWM_UPDTRG_MANUAL = 0,      ///> user must manual set UPDREQ bit to update
//    PWM_UPDTRG_PGxDC = 1,       ///> a write to PGxDC will update
//    PWM_UPDTRG_PGxPHASE = 2,    ///> a write to PGxPHASE will update
//    PWM_UPDTRG_PGxTRIGA = 3     ///> a write to PGxTRIGA will update
//};
//typedef enum PWM_UPDTRG_e PWM_UPDTRG_t;
//
///*********************************************************************************
// * @ingroup GROUP_NAME
// * @def    PWM_Data_Update_Trigger(uint16_t pwmIndex, PWM_UPDTRG_t updateTrigger) 
// * @brief  Set PWM Register update trigger
// * @details
// **********************************************************************************/
//inline static void PWM_Data_Update_Trigger(uint16_t pwmIndex, PWM_UPDTRG_t updateTrigger)
//{
//    switch (pwmIndex)
//    {
//        case 1:
//            PG1EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;
//        case 2:
//            PG2EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;
//        case 3:
//            PG3EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;
//        case 4:
//            PG4EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;
//        case 5:
//            PG5EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;
//        case 6:
//            PG6EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;
//        case 7:
//            PG7EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;       
//        case 8:
//            PG8EVTLbits.UPDTRG = (uint16_t)updateTrigger;
//            break;   
//        default:
//            break;
//    }
//}

#endif	/* DRV_MCC_EXTENSION_H */

